БухЭксп/InformationRegisters/CW_ОбработчикиОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбработчикиОбновления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РежимыВыполненияОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриКаждомОбновлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетПоКурсуНаДатуДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетОтРублевойСуммыБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетОтРублевойСуммыВсего</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_УслугиПоДоговоруГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_УслугиПоДоговоруГрузоперевозки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_УслугиПоДоговоруГрузоперевозки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоменклатураПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРасчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/CommonModules/CW_БухгалтерияЭкспедитораСлужебный/Ext/Module.bsl
//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиковОбновления()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  
	
	//Общие процедуры обновления и первого запуска конфигурации   
	ДобавитьОбработчикиОбновленияИПервогоЗапуска(Обработчики);
	
	//Процедуры обновления на версию   
	ДобавитьПроцедурыОбновленияНаВерсию(Обработчики);
	//Процедуры обновления на версию   
	
	//"CW_ЛичныйКабинетКлиента"
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_ЛичныйКабинетКлиента") Тогда  
		Модуль_CW_ЛичныйКабинетКлиентаСлужебный = CW_ОбщегоНазначения.ОбщийМодуль("CW_ЛичныйКабинетКлиентаСлужебный");
		Модуль_CW_ЛичныйКабинетКлиентаСлужебный.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли; 
	//"CW_ЛичныйКабинетКлиента"    
	
	//"CW_ЭлектронныйОбменДанными"
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_ЭлектронныйОбменДанными") Тогда  
		Модуль_CW_ЭлектронныйОбменДаннымиСлужебный = CW_ОбщегоНазначения.ОбщийМодуль("CW_ЭлектронныйОбменДаннымиСлужебный");
		Модуль_CW_ЭлектронныйОбменДаннымиСлужебный.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли; 
	//"CW_ЭлектронныйОбменДанными"   
	
	//"CW_РаботаСПодключаемымиОбъектами"
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_РаботаСПодключаемымиОбъектами") Тогда  
		Модуль_CW_РаботаСПодключаемымиОбъектамиСлужебный = CW_ОбщегоНазначения.ОбщийМодуль("CW_РаботаСПодключаемымиОбъектамиСлужебный");
		Модуль_CW_РаботаСПодключаемымиОбъектамиСлужебный.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли; 
	//"CW_РаботаСПодключаемымиОбъектами"
	
	
КонецПроцедуры

Процедура ДобавитьОбработчикиОбновленияИПервогоЗапуска(Обработчики)
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.УстановитьНачальныеЗначенияКонстант";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Установить начальные значения констант";
	НоваяСтрока.Комментарий			= "Устанавливает начальные значения консстант:
									| - Валюта регламентированного учета;
									| - Основной язык;      
									| - Валюта hегламентированного eчета - Рубль;
									| - Вариант расчета рублевой суммы НДС статей бюджета";
	
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ЗаполнитьПервоначальныеДанныеСправочникаТипыПеревозок";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Заполнить первоначальные данные справочника ""Типы перевозок""";
	НоваяСтрока.Комментарий			= "Заполняет справочник ""Типы перевозок""";   
	
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ЗаполнитьПараметрыFTPРесурса";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Заполнить параметры FTP-ресурса";
	НоваяСтрока.Комментарий			= "заполняет настройки подключения а ftp-ресурсу для получения обновлений";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ЗаполнитьНачальныеНастройкиПрофилейДоступа";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Заполнить начальные настройки профилей доступа";
	НоваяСтрока.Комментарий			= "Формирует профили доступа для пользователей модуля";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ЗаполнитьНачальнуюНастройкуГруппыПользователя";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Заполнить начальную настройку групп пользователей";
	НоваяСтрока.Комментарий			= "Формирует начальные настройки групп пользоватлей модуля";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ВыполнитьНачальныеНастройкиАвтоблока";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Выполнить начальные настройки автоблока";
	НоваяСтрока.Комментарий			= "Формирует начальные настройки блока учета автотранспорта";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ЛогистическиеСтатусыЗаполнитьПредпоределенныеОбъекты";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Заполнить предпоределенные объекты логистических статусов";
	НоваяСтрока.Комментарий			= "Заполняет предопределенные объеткы использования логистических статусов";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ФинансовыеСтатусыЗаполнитьПредпоределенныеОбъекты";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Заполнить предпоределенные объекты финансовых статусов";
	НоваяСтрока.Комментарий			= "Заполняет предопределенные объеткы использования финансовых статусов";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.УстановитьПорядокРасчетаПредопределенногоЭлемента";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Установить порядок расчета предопределенного элемента";
	НоваяСтрока.Комментарий			= "Устанавливает порядок расчета предопределенного элемента""Отсрочка"" справочника ""Условия оплаты"""; 
	
 	КонецПроцедуры 

Процедура ДобавитьПроцедурыОбновленияНаВерсию(Обработчики)
	
	//ПриКаждомОбновлении     
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ГенерацияГруппПрофилейДоступа";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Генерация групп профилей доступа";
	НоваяСтрока.Комментарий			= "Формирование групп профилей доступа пользователей модуля";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ОбновитьПараметрДатыЕжедневногоОбновления";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Обновить параметр даты ежедневного обновления";
	НоваяСтрока.Комментарий			= "Обновляет значение даты ежедневной проверки обновлений";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ОбновитьСписокМетаданныхДляИсторииОбъектов";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
 	НоваяСтрока.Наименование		= "Обновить список метаданных для истории объектов";
	НоваяСтрока.Комментарий			= "Обновляет списко метаданных для истории объетов";   

	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.УстановитьПраваДляГруппыАдминистраторы";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
 	НоваяСтрока.Наименование		= "Установить права для группы администраторы";
	НоваяСтрока.Комментарий			= "Устанавливает занчения прав доустпа для группы пользователя ""Администраторы""";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ОбновлениеДанныеПоАвтоблоку";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Обновление данных по автоблоку";
	НоваяСтрока.Комментарий			= "Обновление служебных данных блока учета автотранспорта";  
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РегистрацияПрограммыСервер.ОбновитьСтруктуруРасширенныхНастроек";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Отложенно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Обновление настроек модуля";
	НоваяСтрока.Комментарий			= "Обновление служебных настроек модуля";  
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_УведомленияСайтаСервер.УдалениеУстаревшихУведомлений";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_УведомленияСайтаСервер";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;  
	НоваяСтрока.Наименование		= "Удаление ведомлений предыдущих версий";
	НоваяСтрока.Комментарий			= "Удаление ведомлений предыдущих версий";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ЗаполнитьПредопределенныеЭлементыОбязательныхРасширений";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;
	НоваяСтрока.Наименование		= "Заполнить предопределенные элементы обязательных расширений";
	НоваяСтрока.Комментарий			= "Заполнить предопределенные элементы справочника ""Обязательные расширения""";

	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.УдалитьОбработчикиОбновления";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 9;  
	НоваяСтрока.Наименование		= "Удаляет устаревшие обработчики обновления";
	НоваяСтрока.Комментарий			= "Выполняет удаление устарвших обработчиков обновления";
	//---ПриКаждомОбновлении
	
	
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ВыполнитьКонвертациюАдресов";  
	НоваяСтрока.Версия 				= "8.3.18.1";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 9;  
	НоваяСтрока.Наименование		= "Конвертация адресов в справочнике ""Пункты""";
	НоваяСтрока.Комментарий			= "Выполняет конвертацию адресов в справочнике ""Пункты""";
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.УслугиПоДоговоруГрузоперевозкиЗаполнитьРеквизиты";  
	НоваяСтрока.Версия 				= "8.3.18.2";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 9;  
	НоваяСтрока.Наименование		= "Заполнить реквизиты документа ""Протокол согласования цен""";
	НоваяСтрока.Комментарий			= "Заполняет реквизиты: ""Организация"", ""Контрагент"", ""ВалютаДокумента"" документа ""Протокол согласования цен""";

	//Версия 8.3.15.6
	//Версия 8.3.15.6
	//НоваяСтрока = Обработчики.Добавить();
	//НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораСлужебный.ЗаполнитьНастройкиОперативногоУчета";  
	//НоваяСтрока.Версия 				= "8.3.15.6";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитора";
	//НоваяСтрока.НачальноеЗаполнение	= Ложь;
	//НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	//НоваяСтрока.РежимВыполнения		= "Оперативно";
	//НоваяСтрока.ОчередьВыполнения	= 9;  
	//НоваяСтрока.Наименование		= "Заполнить настройки оперативного учета";
	//НоваяСтрока.Комментарий			= "Выполняет обновление данных регистров ""CW_НастройкиУчетаОперативнойЗадолженности""
	//								  |и ""CW_НачалоВеденияОперативногоУчета""";
	//Версия 8.3.15.6

КонецПроцедуры 


//Процедуры первого запуска конфигурации     
Процедура УстановитьНачальныеЗначенияКонстант(АдресРезультата=Неопределено) Экспорт
	
	//ОсновнойЯзык
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	Если (НЕ ЗначениеЗаполнено(ОсновнойЯзык)) Тогда
		Константы.CW_ОсновнойЯзык.Установить(Справочники.CW_Языки.ru);
	КонецЕсли; 
	
	//ВалютаРегламентированногоУчета
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ВалютаРубль = Справочники.Валюты.НайтиПоКоду("643");
	Если ВалютаРубль.Пустая() тогда
		ВалютаРубль = Справочники.Валюты.НайтиПоКоду("RUB");
	КонецЕсли;
	Константы.CW_ВалютаРегламентированногоУчетаРубль.Установить(ВалютаРегламентированногоУчета =  ВалютаРубль);
	
	//ВариантРасчетаРублевойСуммыНДССтатейБюджета
	ЗначениеВарианта = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетПоКурсуНаДатуДокумента"); 
	Константы.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.Установить(ЗначениеВарианта);
	
	
КонецПроцедуры  

Процедура ЗаполнитьПервоначальныеДанныеСправочникаТипыПеревозок(АдресРезультата=Неопределено) Экспорт
	
	мРеквизиты = Справочники.CW_ТипыПеревозок.ПолучитьМассивДоступныхРеквизитовШапки();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	               |ГДЕ
	               |	CW_ТипыПеревозок.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ТипыПеревозок.ЭтоГруппа = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого ДанныеРеквизита из  мРеквизиты Цикл
			
			Отбор = Новый Структура("ИмяРеквизита",ДанныеРеквизита.Имя);
			
			мСтроки = ТОбъект.ПредопределенныеЗначенияРеквизитов.НайтиСтроки(Отбор); 
			Если мСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТОбъект.ПредопределенныеЗначенияРеквизитов.Добавить();
				НоваяСтрока.ИмяРеквизита = ДанныеРеквизита.Имя;
				НоваяСтрока.СинонимРеквизита = ДанныеРеквизита.Синоним;
			КонецЕсли; 
			
		КонецЦикла;
		
		ТОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура ЗаполнитьПараметрыFTPРесурса(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_НастройкиFTPРесурсов.ЗаполнитьПараметрыFTPРесурса();  
	
КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройкиПрофилейДоступа(АдресРезультата=Неопределено) Экспорт
	
	Отказ = Ложь;
	Справочники.CW_ПрофилиДоступа.ЗаполнитьПрофильДоступаНаСервере(Отказ);
	
КонецПроцедуры   

Процедура ЗаполнитьНачальнуюНастройкуГруппыПользователя(АдресРезультата=Неопределено) Экспорт
	
	ГруппаАдминистраторы 				= Справочники.CW_ГруппыПользователей.Администраторы.ПолучитьОбъект();
	ГруппаАдминистраторы.ПолныеПрава 	= Истина;
	ГруппаАдминистраторы.Записать();
	
	мИменаРеквизитов = Справочники.CW_ГруппыПользователей.ПолучитьМассивИменРеквизитовДляПолныхПрав();
	Справочники.CW_ГруппыПользователей.УстановитьЗначениеистинаДляПолныхПрав(мИменаРеквизитов);
	
КонецПроцедуры

Процедура ВыполнитьНачальныеНастройкиАвтоблока(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ТипыТранспортныхСредств.ЗаполнитьЗначенияПреопределенныхЭлементов();
	Справочники.CW_ПоказателиРасчетаРасходаТоплива.ЗаполнитьНачальныеНастрокиРеквизитов();
	
КонецПроцедуры   

Процедура ЛогистическиеСтатусыЗаполнитьПредпоределенныеОбъекты(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ЛогистическиеСтатусы.ЗаполнитьПредпоределенныеОбъекты(ПредопределенноеЗначение("Справочник.CW_ЛогистическиеСтатусы.Грузоперевозки_СтатусНеопределен"),	Тип("СправочникСсылка.CW_Грузоперевозки"));
	Справочники.CW_ЛогистическиеСтатусы.ЗаполнитьПредпоределенныеОбъекты(ПредопределенноеЗначение("Справочник.CW_ЛогистическиеСтатусы.Заявки_СтатусНеопределен"),			Тип("СправочникСсылка.CW_Заявки"));
	Справочники.CW_ЛогистическиеСтатусы.ЗаполнитьПредпоределенныеОбъекты(ПредопределенноеЗначение("Справочник.CW_ЛогистическиеСтатусы.Заказы_СтатусНеопределен"),			Тип("СправочникСсылка.CW_Заказы"));
	
КонецПроцедуры       

Процедура ФинансовыеСтатусыЗаполнитьПредпоределенныеОбъекты(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ФинансовыеСтатусы.ЗаполнитьПредпоределенныеОбъекты(ПредопределенноеЗначение("Справочник.CW_ФинансовыеСтатусы.Грузоперевозки_НеОпределен"),	Тип("СправочникСсылка.CW_Грузоперевозки"));
	Справочники.CW_ФинансовыеСтатусы.ЗаполнитьПредпоределенныеОбъекты(ПредопределенноеЗначение("Справочник.CW_ФинансовыеСтатусы.Заказы_НеОпределен"),			Тип("СправочникСсылка.CW_Заказы"));
	
КонецПроцедуры  

Процедура УстановитьПорядокРасчетаПредопределенногоЭлемента(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_УсловияОплаты.УстановитьПорядокРасчетаПредопределенногоЭлемента();
	
КонецПроцедуры  

Процедура ЗаполнитьПредопределенныеЭлементыОбязательныхРасширений(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ОбязательныеРасширения.ЗаполнитьПредопределенныеЭлементы();
	
КонецПроцедуры
//Процедуры первого запуска конфигурации 

//Обязательные процедуры при переходе на каждый релиз  
 Процедура ОбновитьПараметрДатыЕжедневногоОбновления(АдресРезультата=Неопределено) Экспорт
	
	Попытка
		ПараметрДатыЕжедневногоОбновления = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();
		Если (ПараметрДатыЕжедневногоОбновления.Пустая()) Тогда
			CW_Мониторинг.УстановитьПараметрДатыЕжедневногоОбновления();
		КонецЕсли; 
	Исключение
		СобытиеДляЖурналаРегистрации = Новый Структура;
		СобытиеДляЖурналаРегистрации.Вставить("ИмяСобытия"			, "Обновление: не удалось записать основной язык");
		СобытиеДляЖурналаРегистрации.Вставить("ПредставлениеУровня"	, "Ошибка");
		СобытиеДляЖурналаРегистрации.Вставить("Комментарий"			, ОписаниеОшибки());
		СобытиеДляЖурналаРегистрации.Вставить("ДатаСобытия"			, ТекущаяДата());
		
		СобытияДляЖурналаРегистрации = Новый СписокЗначений;
		СобытияДляЖурналаРегистрации.Добавить(СобытиеДляЖурналаРегистрации);
		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);			
	КонецПопытки; 
	
КонецПроцедуры // ОбязательныйВызов()

Процедура ГенерацияГруппПрофилейДоступа(АдресРезультата=Неопределено) Экспорт

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Идентификатор,
		|	ИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ПолноеИмя
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СоответствиеИдентификаторвМетаданных = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			СоответствиеИдентификаторвМетаданных.Вставить(Выборка.ПолноеИмя, Выборка.Идентификатор);
		КонецЦикла;
		
		// ---------------------------------------------------------------------------- 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПрофилиГруппДоступаРоли.Ссылка КАК Профиль,
		|	ПрофилиГруппДоступаРоли.Роль КАК Роль
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СоответствиеПрофильРоль = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			СоответствиеПрофильРоль.Вставить(Выборка.Роль, Выборка.Профиль);
		КонецЦикла;     
		
		ИдентификатрБухгалтерияЭкспедитора 				= СоответствиеИдентификаторвМетаданных.Получить("Роль.БухгалтерияЭкспедитора");
		ИдентификатрБухгалтерияЭкспедитораАдминистратор = СоответствиеИдентификаторвМетаданных.Получить("Роль.БухгалтерияЭкспедитораАдминистратор");
		ИдентификатрБухгалтерияЭкспедитораМенеджер 		= СоответствиеИдентификаторвМетаданных.Получить("Роль.БухгалтерияЭкспедитораМенеджер");
		ИдентификатрБухгалтерияЭкспедитораСлужебная 	= СоответствиеИдентификаторвМетаданных.Получить("Роль.БухгалтерияЭкспедитораСлужебная");
		
		ЕстьИдентификатрБухгалтерияЭкспедитора  = ЗначениеЗаполнено(ИдентификатрБухгалтерияЭкспедитора);
		
		Если ЕстьИдентификатрБухгалтерияЭкспедитора  Тогда
			
			//Профиль администратора
			ПрофильАдминистратора = СоответствиеПрофильРоль.Получить(ИдентификатрБухгалтерияЭкспедитораАдминистратор);
			
			Если Не ЗначениеЗаполнено(ПрофильАдминистратора) Тогда 
				
				ДобавляемыеРоли = Новый Массив;
				ДобавляемыеРоли.Добавить(ИдентификатрБухгалтерияЭкспедитора);	
				ДобавляемыеРоли.Добавить(ИдентификатрБухгалтерияЭкспедитораАдминистратор);	
			
				// создаем новый профиль доступа
				НовыйПрофилиГруппДоступа = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
				НовыйПрофилиГруппДоступа.Наименование = "Бухгалтерия экспедитора (Администратор)";
				
				Для Каждого Роль из ДобавляемыеРоли Цикл
					НоваяСтрока 		= НовыйПрофилиГруппДоступа.Роли.Добавить();
					НоваяСтрока.Роль 	= Роль;
				КонецЦикла;
				
				НовыйПрофилиГруппДоступа.Записать();
				
			Конецесли;
			
			//Профиль Менеджера
			ПрофильМенеджера = СоответствиеПрофильРоль.Получить(ИдентификатрБухгалтерияЭкспедитораМенеджер);
			
			Если Не ЗначениеЗаполнено(ПрофильМенеджера) Тогда
				
				ДобавляемыеРоли = Новый Массив;
				ДобавляемыеРоли.Добавить(ИдентификатрБухгалтерияЭкспедитора);	
				ДобавляемыеРоли.Добавить(ИдентификатрБухгалтерияЭкспедитораМенеджер);	
				ДобавляемыеРоли.Добавить(ИдентификатрБухгалтерияЭкспедитораМенеджер);
				
				ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры = СоответствиеИдентификаторвМетаданных.Получить("Роль.ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");
				ДобавляемыеРоли.Добавить(ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры);
				
				ЧтениеДанныхФизическихЛицЗарплатаКадры = СоответствиеИдентификаторвМетаданных.Получить("Роль.ЧтениеДанныхФизическихЛицЗарплатаКадры");
				ДобавляемыеРоли.Добавить(ЧтениеДанныхФизическихЛицЗарплатаКадры);
				
				РедактированиеПечатныхФорм = СоответствиеИдентификаторвМетаданных.Получить("Роль.РедактированиеПечатныхФорм");
				ДобавляемыеРоли.Добавить(РедактированиеПечатныхФорм);
				
				ДобавлениеИзменениеНоменклатуры = СоответствиеИдентификаторвМетаданных.Получить("Роль.ДобавлениеИзменениеНоменклатуры");
				ДобавляемыеРоли.Добавить(ДобавлениеИзменениеНоменклатуры);	
				
				НовыйПрофилиГруппДоступа = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
				НовыйПрофилиГруппДоступа.Наименование = "Бухгалтерия Экспедитора (Менеджер)";
				
				//Добавим базовые права
				ДобавитьБазовыеПрава(НовыйПрофилиГруппДоступа, СоответствиеИдентификаторвМетаданных);
	
				Для Каждого Роль из ДобавляемыеРоли Цикл
					НоваяСтрока 		= НовыйПрофилиГруппДоступа.Роли.Добавить();
					НоваяСтрока.Роль 	= Роль;
				КонецЦикла;

				НовыйПрофилиГруппДоступа.Записать();
				
			Иначе
				
				ОбъектПрофильМенеджера 	= ПрофильМенеджера.ПолучитьОбъект();
				
				Если ПрофильМенеджера.Роли.Найти(ИдентификатрБухгалтерияЭкспедитора,"Роль") = Неопределено Тогда
					НоваяСтрока 			= ОбъектПрофильМенеджера.Роли.Добавить();
					НоваяСтрока.Роль 		= ИдентификатрБухгалтерияЭкспедитора;
				КонецЕсли;
				
				//Добавим базовые права
				ДобавитьБазовыеПрава(ОбъектПрофильМенеджера, СоответствиеИдентификаторвМетаданных);
				
				
				ОбъектПрофильМенеджера.Записать();
				
			КонецЕсли; 
			
			//Профиль Служебная
			ПрофильСлужебная = СоответствиеПрофильРоль.Получить(ИдентификатрБухгалтерияЭкспедитораСлужебная);
			
			Если Не ЗначениеЗаполнено(ПрофильСлужебная) Тогда
				
				НовыйПрофилиГруппДоступа = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
				НовыйПрофилиГруппДоступа.Наименование = "Бухгалтерия Экспедитора (Служебная)";
				
				НоваяСтрока 		= НовыйПрофилиГруппДоступа.Роли.Добавить();
				НоваяСтрока.Роль 	= ИдентификатрБухгалтерияЭкспедитораСлужебная;
				
				НовыйПрофилиГруппДоступа.Записать();
				
			КонецЕсли; 
			
			
		КонеЦесли;
	Исключение
		
		СобытиеДляЖурналаРегистрации = Новый Структура;
		СобытиеДляЖурналаРегистрации.Вставить("ИмяСобытия"			, "Обновление: не удалось записать профили доступа");
		СобытиеДляЖурналаРегистрации.Вставить("ПредставлениеУровня"	, "Ошибка");
		СобытиеДляЖурналаРегистрации.Вставить("Комментарий"			, ОписаниеОшибки());
		СобытиеДляЖурналаРегистрации.Вставить("ДатаСобытия"			, ТекущаяДата());
		
		СобытияДляЖурналаРегистрации = Новый СписокЗначений;
		СобытияДляЖурналаРегистрации.Добавить(СобытиеДляЖурналаРегистрации);
		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);			
		
	КонецПопытки; 
	
	
КонецПроцедуры

Процедура ДополнитьРолиМенеджера(АдресРезультата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Идентификатор,
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ПолноеИмя
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответствиеИдентификаторвМетаданных = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СоответствиеИдентификаторвМетаданных.Вставить(Выборка.ПолноеИмя, Выборка.Идентификатор);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрофилиГруппДоступаРоли.Ссылка КАК Профиль,
	|	ПрофилиГруппДоступаРоли.Роль КАК Роль
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответствиеПрофильРоль = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СоответствиеПрофильРоль.Вставить(Выборка.Роль, Выборка.Профиль);
	КонецЦикла;     
	
	ИдентификатрБухгалтерияЭкспедитораМенеджер	= СоответствиеИдентификаторвМетаданных.Получить("Роль.БухгалтерияЭкспедитораМенеджер");
	ДобавлениеИзменениеНоменклатуры 			= СоответствиеИдентификаторвМетаданных.Получить("Роль.ДобавлениеИзменениеНоменклатуры");
	
	ПрофильМенеджера = СоответствиеПрофильРоль.Получить(ИдентификатрБухгалтерияЭкспедитораМенеджер);

	ОбъектПрофильМенеджера 	= ПрофильМенеджера.ПолучитьОбъект();
	Если ПрофильМенеджера.Роли.Найти(ДобавлениеИзменениеНоменклатуры,"Роль") = Неопределено Тогда
		НоваяСтрока 			= ОбъектПрофильМенеджера.Роли.Добавить();
		НоваяСтрока.Роль 		= ДобавлениеИзменениеНоменклатуры;
	КонецЕсли;
	
	ОбъектПрофильМенеджера.Записать();
	
КонецПроцедуры

Процедура ОбновитьСписокМетаданныхДляИсторииОбъектов(АдресРезультата=Неопределено) Экспорт 
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_МетаданныеКонфигурации.Ссылка КАК Ссылка,
	               |	CW_МетаданныеКонфигурации.ДляИсторииОбъектов КАК ДляИсторииОбъектов,
	               |	CW_МетаданныеКонфигурации.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.CW_МетаданныеКонфигурации КАК CW_МетаданныеКонфигурации";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	ПодсистемаБухгалтерияЭкспедитора = CW_ОбновлениеКонфигурацииСервер.ПодсистемаБухгалтерияЭкспедитора();
	
	Для каждого Метаданное Из ПодсистемаБухгалтерияЭкспедитора.Состав Цикл
		
		ИмяМетаданного = Метаданное.ПолноеИмя();
		Если Найти(ИмяМетаданного,"Справочник.") <> 0 ИЛИ Найти(ИмяМетаданного,"Документ.") <> 0 Тогда
			
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Новый Структура("Наименование",ИмяМетаданного)) Тогда
				ОбъектМетаданоеКонфигурации = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				ОбъектМетаданоеКонфигурации = Справочники.CW_МетаданныеКонфигурации.СоздатьЭлемент();
			КонецЕсли;
			
			ОбъектМетаданоеКонфигурации.Наименование 			= ИмяМетаданного;
			ОбъектМетаданоеКонфигурации.ДляИсторииОбъектов 		= Истина;
			ОбъектМетаданоеКонфигурации.ОбменДанными.Загрузка 	= Истина;
			ОбъектМетаданоеКонфигурации.Записать();
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок");
	МассивИмен.Добавить("Справочник.Контрагенты");
	МассивИмен.Добавить("Справочник.ДоговорыКонтрагентов");
	МассивИмен.Добавить("Справочник.Номенклатура");
	
	Для Каждого ИмяЭлемента из МассивИмен Цикл
		
		НайденнаяСсылка = Справочники.CW_МетаданныеКонфигурации.НайтиПоНаименованию(ИмяЭлемента);
		
		Если НайденнаяСсылка.Пустая() Тогда
			ОбъектМетаданоеКонфигурации = Справочники.CW_МетаданныеКонфигурации.СоздатьЭлемент();
		Иначе
			ОбъектМетаданоеКонфигурации = НайденнаяСсылка.ПолучитьОбъект();
		КонецЕсли;
		ОбъектМетаданоеКонфигурации.Наименование 			= ИмяЭлемента;
		ОбъектМетаданоеКонфигурации.ДляИсторииОбъектов 		= Истина;
		ОбъектМетаданоеКонфигурации.ОбменДанными.Загрузка 	= Истина;
		ОбъектМетаданоеКонфигурации.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПраваДляГруппыАдминистраторы(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ГруппыПользователей.УстановитьПраваДляГруппыАдминистраторы();
	
КонецПроцедуры

Процедура ДобавитьБазовыеПрава(Профиль, СоответствиеИдентификаторвМетаданных)
	
	мИсключения = Новый Массив;
	мИсключения.Добавить("БазовыеПраваВнешнихПользователейБСП");
	
	Для Каждого Метаданное из Метаданные.Роли Цикл
		Если мИсключения.Найти(Метаданное.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(ВРЕГ(Метаданное.Имя),"БАЗОВЫЕПРАВА") > 0 Тогда
			ИдентификатрБазовыеПрава 	= СоответствиеИдентификаторвМетаданных.Получить("Роль."+Метаданное.Имя);
			Если Профиль.Роли.Найти(ИдентификатрБазовыеПрава,"Роль") = Неопределено Тогда
				НоваяСтрока 			= Профиль.Роли.Добавить();
				НоваяСтрока.Роль 		= ИдентификатрБазовыеПрава;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеДанныеПоАвтоблоку(АдресРезультата=Неопределено) Экспорт

	Попытка
		// краткое наименование предопределенных документов автоблока
		ДокументПТС = Справочники.CW_ВидыДокументовТС.ПаспортТранспортногоСредства.ПолучитьОбъект();
		Если (НЕ ЗначениеЗаполнено(ДокументПТС.КраткоеНаименование)) Тогда
			ДокументПТС.КраткоеНаименование = "ПТС";
		КонецЕсли; 
		ДокументПТС.Записать();
		
		ДокументСвидетельство = Справочники.CW_ВидыДокументовТС.СвидетельствоОРегистрации.ПолучитьОбъект();
		Если (НЕ ЗначениеЗаполнено(ДокументСвидетельство.КраткоеНаименование)) Тогда
			ДокументСвидетельство.КраткоеНаименование = "Свидетельство";
		КонецЕсли; 
		ДокументСвидетельство.Записать();
	Исключение
		
		СобытиеДляЖурналаРегистрации = Новый Структура;
		СобытиеДляЖурналаРегистрации.Вставить("ИмяСобытия"			, "Обновление: не удалось обновить параметры учета автотрансопрта");
		СобытиеДляЖурналаРегистрации.Вставить("ПредставлениеУровня"	, "Ошибка");
		СобытиеДляЖурналаРегистрации.Вставить("Комментарий"			, ОписаниеОшибки());
		СобытиеДляЖурналаРегистрации.Вставить("ДатаСобытия"			, ТекущаяДата());
		
		СобытияДляЖурналаРегистрации = Новый СписокЗначений;
		СобытияДляЖурналаРегистрации.Добавить(СобытиеДляЖурналаРегистрации);
		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);			
		
	КонецПопытки; 
	
КонецПроцедуры

Процедура УдалитьОбработчикиОбновления(АдерсРезультата=Неопределено) Экспорт 
	
	Массив = Новый Массив;
	Массив.Добавить("CW_БухгалтерияЭкспедитораСлужебный.ВыполнитьПеренумерациюГрузоперевозок");
	
	РегистрыСведений.CW_ОбработчикиОбновления.УдалитьУстаревшиеОбработчики(Массив);
	
КонецПроцедуры
//Обязательные процедуры при переходе на каждый релиз   


//Процеудры обновления текущий релизов 
Процедура ВыполнитьКонвертациюАдресов(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_Пункты.ВыполнитьКонвертациюАдресов();
	
КонецПроцедуры

Процедура УслугиПоДоговоруГрузоперевозкиЗаполнитьРеквизиты(АдресРезультата = Неопределено) Экспорт

	Документы.CW_УслугиПоДоговоруГрузоперевозки.ЗаполнитьРеквизитыДокументов();
	
КонецПроцедуры
//Процеудры обновления текущий релизов
